app/views/persons/index.html.erb

SELECT "persons".* FROM "persons"
---
  <tr>
    <th><%= t 'activerecord.attributes.person.firstname'%></th>