app/views/customers/index.html.erb

  <tr>
    <th><%= t 'activerecord.attributes.customer.firstname'%></th>
---
SELECT "customers".* FROM "customers"