app/controllers/customers_controller.rb

  def show
    @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @customer = Customer.find(params[:id])
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    #debugger
    to_gregorian (params)
    #debugger
    @customer = Customer.new(params[:customer])

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("birthdate", "created_at", "email", "fathername", "firstname", "gender", "identity_issue_city", "identity_issue_date", "identity_no", "identity_serial", "lastname", "legal_type", "marital_status", "national_no", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @customer = Customer.find(params[:id])
    @customer.destroy
---
SELECT "customers".* FROM "customers" WHERE "customers"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "customers" WHERE "customers"."id" = ?  [["id", 1]]