app/controllers/persons_controller.rb

SELECT "persons".* FROM "persons"
---
  def index
    @persons = Person.all